app/Controllers/Autor.php

SELECT *
FROM `autor`
---
    public function index(){
        $dados = $this->autorModel->findAll();