app/Controllers/Editora.php

SELECT *
FROM `editoras`
---
    public function index(){
        $dados = $this->editoraModel->findAll();

INSERT INTO `editoras` (`nome`, `email`, `telefone`) VALUES ('eu', 'eu@gmail.com', '65675456')
---
    public function cadastrar(){
        $editora = $this->request->getPost();
        $editora['senha']= md5("senhaforte");
        $this->editoraModel->save($editora);

SELECT *
FROM `editoras`
WHERE `editoras`.`id` = '5'
---
    public function editar($id){
        $dados = $this->editoraModel->find($id);