app/Controllers/Emprestimo.php

    public function index()
    {
        $dados = $this->EmprestimoModel->findAll();
        $dadosaluno = $this->AlunoModel->findAll();
        $dadosusuario = $this->UsuarioModel->findAll();
        $dadosobra = $this->ObraModel->findAll();
        $dadoslivro = $this->LivroModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `obra`
SELECT *
FROM `livro`

    public function devolucao($id)
    {
        $dados = $this->EmprestimoModel->find($id);
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '23'

    public function salvar_devolucao(){
        $dados = $this->request->getPost();
        $this->LivroModel->update($dados['id_livro'], ['disponivel' => 1]);
        $this->EmprestimoModel->save($dados);
---
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('13')
UPDATE `emprestimo` SET `id_livro` = '13', `data_fim` = '2024-06-28'
WHERE `emprestimo`.`id` IN ('22')