app/Controllers/Livro.php

SELECT *
FROM `obra`
SELECT *
FROM `livro`
---
    public function index(){
        $obra = $this->obraModel->findAll();
        $livro = $this->livroModel->findAll();

SELECT *
FROM `livro`
WHERE `livro`.`id` = '13'
SELECT *
FROM `obra`
---
    public function editar($id){
        $livro = $this->livroModel->find($id);
        $obra = $this->obraModel->findAll();