app/Controllers/Obra.php

SELECT *
FROM `obra`
SELECT *
FROM `editoras`
---
    public function index(){
        $obra = $this->obraModel->findAll();
        $editoras = $this->editoraModel->findAll();

INSERT INTO `obra` (`titulo`, `categoria`, `ano_publicacao`, `isbn`, `id_editoras`) VALUES ('harry poti', 'gamaer', '4424', '453543', '6')
---
    public function cadastrar(){
        $obra = $this->request->getPost();
        $this->obraModel->save($obra);